# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
import sqlite3
import pandas as pd
#Your code here

In [2]:
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [3]:
cur.execute('''SELECT e.firstName, e.lastName FROM employees e
                                              JOIN offices o
                                              USING (officeCode)
                                              WHERE o.city="Boston";''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Do any offices have no employees?

In [4]:
cur.execute("""SELECT o.city,
                    count(e.employeeNumber)
                    FROM offices o
                    JOIN employees e
                    USING(officeCode)
                    GROUP BY o.city;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

            city  count(e.employeeNumber)
0         Boston                        2
1         London                        2
2            NYC                        2
3          Paris                        5
4  San Francisco                        6
5         Sydney                        4
6          Tokyo                        2

## Write 3 Questions of your own and answer them

In [12]:
#What are the names of the clients that are associated with the Paris sales representatives?
#Which customer ordered more that 90 items of any product?
#Which customer bought ships
# Answers will vary

In [6]:
cur.execute("""SELECT c.customerName, e.firstName, e.lastName
                    FROM customers c
                    LEFT JOIN employees e
                    ON e.employeeNumber=c.salesRepEmployeeNumber 
                    WHERE e.officeCode=(SELECT officeCode FROM offices WHERE city="Paris")
                    ;""")
df = pd.DataFrame(cur.fetchall())
print(len(df))
df.head()
# Your code here

29

                           0     1       2
0          Auto Canal+ Petit  Loui  Bondur
1  La Corne D'abondance, Co.  Loui  Bondur
2            Lyon Souveniers  Loui  Bondur
3       Marseille Mini Autos  Loui  Bondur
4         Reims Collectables  Loui  Bondur

In [11]:
cur.execute("""SELECT c.customerName, o.orderNumber, p.productName, d.quantityOrdered
                    FROM customers c
                    LEFT JOIN orders o
                    LEFT JOIN orderdetails d
                    LEFT JOIN products p
                    ON c.customerNumber=o.customerNumber AND p.productCode=d.productCode AND d.orderNumber=o.orderNumber
                    WHERE d.quantityOrdered > '90'
                    ;""")
df = pd.DataFrame(cur.fetchall())
print(len(df))
df.head()
# Your code here

39772

                   0      1     2   3
0  Atelier graphique  10100  None  97
1  Atelier graphique  10101  None  97
2  Atelier graphique  10102  None  97
3  Atelier graphique  10103  None  97
4  Atelier graphique  10104  None  97

In [ ]:
cur.execute("""SELECT c.customerName, p.productName
                      FROM customers c
                      LEFT JOIN orders o
                      LEFT JOIN orderdetails d
                      LEFT JOIN products p
                      ON c.customerNumber=o.customerNumber AND p.productCode=d.productCode AND d.orderNumber=o.orderNumber
                      WHERE p.productLine='Ships'
                    ;""")
df = pd.DataFrame(cur.fetchall())
print(len(df))
df.head()
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [ ]:
# Your code here

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!